% ХЯОНКЭГНБЮМХЕ ЛЕРНДНБ matlab pdetool ДКЪ ТНПЛХПНБЮМХЪ 2D РПХЮМЦСКХПНБЮММНИ ПЮАНВЕИ НАКЮЯРХ  
N = 1; % ЙНКХВЕЯРБН СПЮБМЕМХИ Б ВЮЯРМШУ ОПНХГБНДМШУ 
model = createpde(N); % ТНПЛХПСЕЛ НЯМНБМНИ НАЗЕЙР - РХОЮ PDEModel

% ЙНДШ НОПЕДЕКЪЧЫХЕ РХО ЦПЮМХЖ
% CIRC=1; % - НЙПСФМНЯРЭ
% POLY=2; % - ОНКХЦНМ
% RECT=3; % - ОПЪЛНСЦНКЭМХЙ
% ELLI=4; % - ЩККХОЯ

% ОПЕДЮБПХЕРЕКЭМНЕ НОХЯЮМХЕ ЩКЕЛЕМРНБ ЦПЮМХЖ (ГДЕЯЭ - НДХМ 5-СЦНКЭМХЙ Х 2 НЙПСФМНЯРХ)
R1 = [2,5,  -3,3,3.9,-1,-4.5,   3.6,1.5,-3,-4.5,-3.*0.75]'; % 5-РХ СЦНКЭМХЙ
C1 = [1, -3,3.5,  1.5]'; % НЙПСФМНЯРЭ 1 Я ЖЕМРПНЛ Б РНВЙЕ (-3,3.5) Х ПЮДХСЯНЛ 1.5
C1 = [C1;zeros(length(R1) - length(C1),1)];
C1_ = [1,  0,2,   2.0]'; % НЙПСФМНЯРЭ 1_ Я ЖЕМРПНЛ Б РНВЙЕ (3,2) Х ПЮДХСЯНЛ 2
C1_ = [C1_;zeros(length(R1) - length(C1_),1)];
C2 = [1, 0,-4.5,  1.0]'; % НЙПСФМНЯРЭ 2 Я ЖЕМРПНЛ Б РНВЙЕ (0,-4.5) Х ПЮДХСЯНЛ 1
C2 = [C2;zeros(length(R1) - length(C2),1)];
C2_ = [1,  -4,-2,  1.7]'; % НЙПСФМНЯРЭ 2_ Я ЖЕМРПНЛ Б РНВЙЕ (-4,-2) Х ПЮДХСЯНЛ  1.7
C2_ = [C2_;zeros(length(R1) - length(C2_),1)];
gm = [R1,C1,C1_,C2,C2_]; % ТНПЛХПСЕЛ ЛЮРПХЖС ЙЮФДШИ ЯРНКАЕЖ ЙНРНПНИ НОХЯШБЮЕР НДХМ ЩКЕЛЕМР ЦПЮМХЖШ
sf = 'R1+C1+C2+C1_+C2_'; % ТНПЛСКЮ ЯКНФЕМХЪ БЯЕУ ЦПЮМХЖ Б НДМС
%gm = R1;
%sf = 'R1';

ns = char('R1','C1','C1_','C2','C2_'); % ЯОХЯНЙ МЮГБЮМХИ ЦПЮМХЖ
%ns = char('R1');
ns = ns';
g = decsg(gm,sf,ns); % ТНПЛХПСЕР ЕДХМНЕ НОХЯЮМХЕ ЦПЮМХЖ Б g Х ПЮГАХБЮЕР ПЮАНВСЧ НАКЮЯРЭ МЮ НДМНЯБЪГМШЕ ЩКЕЛЕМРЮ

pg = geometryFromEdges(model,g); % ТНПЛХПСЕР 'ЦЕНЛЕРПХЧ' ГЮДЮВХ - ДНАЮБКЪЕР Б model ДЮММШЕ Н ЦПЮМХЖЕ ПЮЯВЕРМНИ НАКЮЯРХ
mesh = generateMesh(model,'Hmax',0.2); % ЦЕМЕПХПСЕР ПЮГАХЕМХЕ РПХЮМЦСКХПНБЮММНЕ ПЮАНВЕИ НАКЮЯРХ

tr = mesh.Elements(1:3,:)'; % БШКЕДЪЕЛ РПЕСЦНКЭМХЙХ (РПНИЙХ МНЛЕПНБ БЕПЬХМ ОПХМЮДКЕФЮЫХЕ НДМНЛС РПЕСЦНКЭМХЙС)
n = max(tr(:)); % ЙНКХВЕЯРБН БЕПЬХМ Б СГКЮУ ЯЕРЙХ
x = mesh.Nodes(1,1:n)'; % x - ЙННПДХМЮРШ БЕПЬХМ
y = mesh.Nodes(2,1:n)'; % y - ЙННПДХМЮРШ БЕПЬХМ

ii = [tr(:,1);tr(:,2);tr(:,3);tr(:,1);tr(:,2);tr(:,3)]; % МНЛЕПЮ ЯРПНЙ МЕМСКЕБШУ ЩКЕЛЕМРНБ ЛЮРПХЖШ ЯБЪГМНЯРХ 
jj = [tr(:,2);tr(:,3);tr(:,1);tr(:,3);tr(:,1);tr(:,2)]; % МНЛЕПЮ ЯРНКЖНБ МЕМСКЕБШУ ЩКЕЛЕМРНБ ЛЮРПХЖШ ЯБЪГМНЯРХ

A = sparse(ii,jj,1,n,n); % ТНПЛХПСЕР ПЮГПЕФЕММСЧ ЛЮРПХЖС ЯБЪГМНЯРХ. ДКЪ ОНБРНПЪЫХУЯЪ ОЮП (ii,jj) ОПНХГБНДХРЭЯЪ ЯСЛЛХПНБЮМХЕ СЙЮГЮММШУ МЕМСДКЕБШУ ГМЮВЕМХИ (Б ДЮММНЛ ЯКСВЮЕ - ЕДХМХЖ)
d = abs(sum(A)) + 1; % ЙНКХВЕЯРБЮ РПЕСЦНКЭМХЙНБ Б ЙНРНПШЕ БУНДХР БЕПЬХМЮ (МЮ ЕДХМХЖС АНКЭЬЕ) 
A = A + diag(sparse(d)); % ГЮОНКМЪЕЛ ДХЮЦНМЮКЭ

figure;
hold on;
grid on;
pdemesh(model); % ПХЯСЕЛ ПЮАНВСЧ НАКЮЯРЭ Х ЦПЮМХЖШ

%gplot(A,[x y]); % ОНГБНКЪЕР НРНАПЮГХРЭ ЯЕРЙС ВЕПЕГ ХЯОНКЭГНБЮМХЕ ЛЮРПХЖШ
%ЯБЪГМНЯРХ  A
axis equal;


% ПЮГМШЕ ТСМЙЖХХ
%r1 = sqrt((x).^2 + (y).^2);
%r2 = sqrt((x+0.4).^2 + (y-0.2).^2);
%r3 = sqrt((x-0.5).^2 + (y+0.5).^2);
%u = -exp(-(r1.^2)./0.1)+exp(-(r2.^2)./0.2)+exp(-(r3.^2)./0.05);
%u = sqrt((x-0.5).^2+(y-0.5).^2).*exp(-((x-0.5).^2 + (y-0.5).^2)).*sin(atan2(x,y));
u= peaks(x./1.2,y./1.2);


figure;
hold on;
grid on;
trimesh(tr,x,y,u); % ЯРПНХР ЦПЮТХЙ 2D ТСМЙЖХХ НОПЕДЕК╦ММНИ МЮ БЕПХЬХМЮУ РПХЮМЦСКХПНБЮММНИ ЯЕРЙХ
%plot3(x,y,u,'.');
%set(gca,'XLim',[-4.5 4.5],'YLim',[-4.5 4.5],'Zlim',[-25 25]);
daspect([1 1 1]);